{
  "backend/main.mo": "Motoko backend storing contact form entries with validation and retrieval via list operations.",
  "feature_evidence.json": "Metadata file listing features, related files, components, and confidence for build/deployment tasks.",
  "frontend-file-summaries.txt": "Text file mapping frontend source paths to human‑written summaries of component purpose and behavior.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing prerequisites and steps for building and publishing the app to the Internet Computer.",
  "frontend/index.css": "Tailwind base and theme variables defining OKLCH color tokens and dark-mode overrides.",
  "frontend/index.html": "Basic HTML entry point with root div and script loading the Vite/React main entry.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and renders them within the SiteLayout component.",
  "frontend/src/components/BookFreeConsultationCTA.tsx": "CTA component offering WhatsApp, phone, and contact form actions in default or compact variants.",
  "frontend/src/components/ContactForm.tsx": "Form component with field validation, success/error states, and backend mutation for submitting contact messages.",
  "frontend/src/components/home/GovernmentSubsidySection.tsx": "Displays subsidy benefit highlights with cards and a detailed breakdown table of central and state solar subsidies.",
  "frontend/src/components/home/HeroSlider.tsx": "Provides an auto-rotating hero banner slider with images, promotional text, and call-to-action buttons.",
  "frontend/src/components/home/HomeFooterCTASection.tsx": "Shows a footer call‑to‑action section with contact info, quick actions, and a consultation form.",
  "frontend/src/components/home/HomeSolarCalculatorSection.tsx": "Renders a solar savings calculator with monthly bill input and displays computed system details. Uses helper functions to calculate system size and show results alongside a link to book a site survey.",
  "frontend/src/components/home/HowSolarWorksSection.tsx": "Displays a visual explanation of how solar systems work using an infographic and step-by-step icons. Includes Hindi descriptions and a detailed text explanation.",
  "frontend/src/components/home/OurSolarServicesSection.tsx": "Lists various solar service offerings in a grid of cards, each with an icon, title, and description. Provides an overview of residential, commercial, and specialized solar solutions.",
  "frontend/src/components/home/WhyChooseTrustSection.tsx": "Shows trust factors for choosing the company, using cards highlighting certifications, quality, EPC services, and support. Emphasizes reliability and customer assurance.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with brand info, navigation links, services list, and contact details including a fallback logo handler.",
  "frontend/src/components/SiteHeader.tsx": "Implements the site header with logo handling, navigation links, mobile menu, and consultation contact dropdowns.",
  "frontend/src/components/SiteLayout.tsx": "Defines the main page layout wrapping content with a header and footer.",
  "frontend/src/data/projects.ts": "Defines a Project interface and exports an array of sample solar installation projects. Each entry includes location, capacity, image, and key benefits.",
  "frontend/src/data/serviceDetails.ts": "Exports detailed service descriptions for multiple solar system types including features, benefits, and target users. Provides SEO fields and long-form content for each service.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity authentication using React Query. Automatically refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for managing Internet Identity authentication using AuthClient, exposing identity state, login, and clear actions.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query mutation for submitting contact form data through the backend actor and invalidates related queries on success.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines light/dark theme CSS variables and utility classes.",
  "frontend/src/lib/assets.ts": "Utility functions to generate production-safe URLs for static and generated assets respecting base paths.",
  "frontend/src/lib/brand.ts": "Exports shared branding constants including application name, logo path, and tagline.",
  "frontend/src/lib/seo.ts": "Provides helpers to set page title and meta tags for SEO and Open Graph.",
  "frontend/src/lib/solarCalculator.ts": "Implements solar system calculation logic, subsidies, formatting helpers, and related constants.",
  "frontend/src/lib/solarKwImages.ts": "Maps solar system sizes to representative image paths with fallback handling.",
  "frontend/src/main.tsx": "Initializes React app by mounting providers and rendering the main App component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company overview, vision, and SEO metadata setup.",
  "frontend/src/pages/CalculatorPage.tsx": "Renders an interactive solar calculator page that computes solar system sizing and savings with dynamic images and SEO setup.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with SEO setup, hero section, company contact details, and a contact form.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with SEO setup and multiple feature sections including hero slider, subsidy info, services, and calculator.",
  "frontend/src/pages/HowItWorksPage.tsx": "Shows how solar energy works with SEO setup, a hero section, infographic, process steps, and benefits.",
  "frontend/src/pages/ProjectsPage.tsx": "Presents the projects portfolio with SEO setup, stats, and a gallery of completed solar installations.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Loads a specific service by slug, sets SEO, and displays its overview, features, benefits, and related details.",
  "frontend/src/pages/ServicesPage.tsx": "Lists all available solar services with SEO setup, icons, descriptions, and links to detail pages.",
  "frontend/src/pages/SubsidiesPage.tsx": "React page displaying government solar subsidy information with SEO setup and styled sections using cards and tables.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and container settings with added plugins.",
  "project_state.json": "JSON metadata describing project state, deployment issues, and pending feature requests related to fixing build failures and publishing the site."
}