{
  "backend/main.mo": "Motoko canister storing validated contact form entries, providing submission and retrieval functions.",
  "feature_evidence.json": "Feature evidence report listing feature requirements, related files, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files including pages, components, hooks, and config.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Base HTML file loading the React app root and main entry script.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all site pages using SiteLayout as root.",
  "frontend/src/components/ContactForm.tsx": "Contact form with client-side validation, success/error states, and backend submission integration.",
  "frontend/src/components/SiteFooter.tsx": "Footer with logo fallback, company info, navigation links, services, and updated contact details.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header featuring logo fallback, desktop navigation, and mobile drawer menu with active highlighting.",
  "frontend/src/components/SiteLayout.tsx": "Defines the main site layout with header, footer, and routed content via Outlet.",
  "frontend/src/data/projects.ts": "Exports a Project interface and a list of sample solar project entries with details and benefits.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling identity loading, login, logout, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation hook to submit contact form data through the backend actor and invalidate related queries.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, and global base and utility rules.",
  "frontend/src/lib/seo.ts": "Utility to set page SEO metadata including title, description, and Open Graph tags.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO setup, company overview, vision, mission, and director info.",
  "frontend/src/pages/ContactPage.tsx": "Renders the Contact page with SEO setup, contact details, office locations, and a contact form.",
  "frontend/src/pages/HomePage.tsx": "Home page component with hero content, service highlights, testimonial data, and SEO setup.",
  "frontend/src/pages/ProjectsPage.tsx": "Projects portfolio page displaying project stats, featured projects, and SEO configuration.",
  "frontend/src/pages/ServicesPage.tsx": "Services page defining multiple solar service offerings with features and SEO initialization.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, animations, and plugins.",
  "project_state.json": "Project state file describing site goals, required assets, features, issues, and pending requests."
}