{
  "backend/main.mo": "Actor managing contact form entries with validation, storage in a list, and query access.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all major frontend files.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Root HTML template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all pages wrapped in SiteLayout.",
  "frontend/src/components/ContactForm.tsx": "Form component with client-side validation, success/error states, and backend submission.",
  "frontend/src/components/SiteFooter.tsx": "Footer showing company info, navigation links, services list, and contact details.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo, desktop navigation, and mobile drawer menu with active-state styling.",
  "frontend/src/components/SiteLayout.tsx": "Page layout wrapper rendering header, routed content, and footer.",
  "frontend/src/data/projects.ts": "Defines a Project interface and exports a list of sample solar project entries with details and benefits.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's identity, refetching queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities, handling login/logout, and exposing auth status.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation hook for submitting a contact form entry through the backend actor and invalidates related queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color variables, theming rules, and base typography styles.",
  "frontend/src/lib/seo.ts": "Utility for setting document title and meta tags, including Open Graph tags for SEO.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO metadata, company overview, vision, and mission content.",
  "frontend/src/pages/ContactPage.tsx": "Renders the Contact page with SEO metadata, contact details, and a contact form component.",
  "frontend/src/pages/HomePage.tsx": "Home page component with hero, service highlights, benefits, testimonials and SEO setup.",
  "frontend/src/pages/ProjectsPage.tsx": "Projects portfolio page displaying stats and a gallery of project cards with images and details.",
  "frontend/src/pages/ServicesPage.tsx": "Services page listing detailed solar service offerings with icons, descriptions, and feature lists, plus SEO setup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, typography, animations, containers, and plugins.",
  "project_state.json": "Project metadata describing site goals, requirements, architecture notes, features and image needs for GKV Smart Energy website."
}