{
  "backend/main.mo": "Motoko actor storing and validating contact form entries, allowing submission and retrieval.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across the project.",
  "frontend/index.css": "Tailwind CSS base/theme configuration defining color variables and light/dark mode styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all site routes and wraps them in the SiteLayout component.",
  "frontend/src/components/BookFreeConsultationCTA.tsx": "CTA component offering WhatsApp, call, and contact form actions in compact or full card variants.",
  "frontend/src/components/ContactForm.tsx": "Contact form with validation, success/error handling, and backend submission via React Query.",
  "frontend/src/components/SiteFooter.tsx": "React footer component showing company info, navigation links, services, and contact details with a fallback logo.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo, navigation links, mobile menu, and consultation contact actions.",
  "frontend/src/components/SiteLayout.tsx": "Layout wrapper that renders the site header, footer, and routed page content.",
  "frontend/src/data/projects.ts": "Static dataset defining multiple solar project entries with metadata and benefits.",
  "frontend/src/data/serviceDetails.ts": "Structured service descriptions including SEO fields, features, benefits, and target audiences.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and refreshes related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth state, login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Provides a mutation hook for submitting contact form data to the backend and invalidating related queries.",
  "frontend/src/index.css": "Sets Tailwind layers and defines extensive CSS variables for light and dark themes plus base typography utilities.",
  "frontend/src/lib/seo.ts": "Provides functions to set document title and meta tags for SEO and social sharing.",
  "frontend/src/lib/solarCalculator.ts": "Implements solar calculation logic including assumptions, subsidy rules, system sizing, savings estimation, and formatting helpers.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company overview, vision, mission, leadership info, and sets SEO metadata.",
  "frontend/src/pages/CalculatorPage.tsx": "Renders an interactive solar savings calculator using utility functions and updates SEO on load.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details, office locations, a contact form, and sets page SEO.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with hero content, services, testimonials, and sets SEO metadata.",
  "frontend/src/pages/HowItWorksPage.tsx": "Renders a detailed explanation of how a grid-connected solar system works, including steps, diagrams, and benefits. Sets SEO metadata and displays a consultation CTA.",
  "frontend/src/pages/ProjectsPage.tsx": "Displays a portfolio of solar projects with stats, a gallery, and SEO setup. Uses project data to render cards with images, capacity, and locations.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Shows detailed information for a specific solar service using dynamic routing, including overview, features, benefits, and SEO metadata. Handles missing services with a fallback screen.",
  "frontend/src/pages/ServicesPage.tsx": "Lists all available solar services in a grid with icons, descriptions, and links to detail pages. Sets SEO data and includes a consultation CTA section.",
  "frontend/src/pages/SubsidiesPage.tsx": "Explains available government solar subsidies with cards, tables, and SEO setup. Includes subsidy amounts and a consultation CTA.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, container settings, animations, and plugins for the project.",
  "project_state.json": "Defines the project’s current website plan, required features, image needs, and architectural notes for building the GKV Smart Energy Services site. Lists existing features including subsidy upgrades, a working diagram section, services refactor, and a solar calculator."
}