{
  "backend/main.mo": "Motoko canister storing and validating contact form entries, with submit and query functions using trimmed fields and basic email checks.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their purpose, routes, components, and page content.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark mode using OKLCH color values.",
  "frontend/index.html": "HTML entry file setting up the root container and loading the main React script.",
  "frontend/src/App.tsx": "Main React app that configures TanStack Router routes and attaches them to the SiteLayout component.",
  "frontend/src/components/BookFreeConsultationCTA.tsx": "CTA component offering WhatsApp, call, and contact form actions in default or compact layouts.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with validation, success/error states, and backend submission via a React Query mutation.",
  "frontend/src/components/SiteFooter.tsx": "Renders the website footer with brand info, quick links, services list, and contact details, including fallback logic for logo errors.",
  "frontend/src/components/SiteHeader.tsx": "Implements a responsive site header with navigation links, logo handling, mobile menu, and consultation contact options.",
  "frontend/src/components/SiteLayout.tsx": "Defines the main page layout including header, footer, and routed content via an Outlet.",
  "frontend/src/data/projects.ts": "Exports a typed list of sample solar projects with details like location, capacity, images, and benefits.",
  "frontend/src/data/serviceDetails.ts": "Provides structured metadata and descriptions for various solar services, including features, benefits, and SEO fields.",
  "frontend/src/hooks/useActor.ts": "Loads an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and context provisioning for identity-aware components.",
  "frontend/src/hooks/useQueries.ts": "Adds a mutation hook for submitting contact form data through the backend actor and invalidating related queries.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables and base typography utilities.",
  "frontend/src/lib/brand.ts": "Exports brand constants including name, logo path, and tagline.",
  "frontend/src/lib/seo.ts": "Provides functions to update document title and meta tags for SEO and Open Graph.",
  "frontend/src/lib/solarCalculator.ts": "Implements solar system calculation logic, subsidy rules, and formatting helpers.",
  "frontend/src/lib/solarKwImages.ts": "Maps solar system size ranges to representative images with descriptions and provides a fallback image.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company overview, vision, mission, and SEO setup.",
  "frontend/src/pages/CalculatorPage.tsx": "Renders an interactive solar savings calculator with inputs, results, images, and SEO setup.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details, offices, and a consultation form, along with SEO initialization.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying hero content, service highlights, testimonials, and calls to action with SEO setup.",
  "frontend/src/pages/HowItWorksPage.tsx": "Explains how a grid‑connected solar system works with steps, infographic, benefits, and SEO configuration.",
  "frontend/src/pages/ProjectsPage.tsx": "Shows hero section, project stats, and a gallery of featured solar installations populated from project data.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Loads a service by slug and displays its details, features, benefits, and SEO metadata with a fallback for missing services.",
  "frontend/src/pages/ServicesPage.tsx": "Lists all available solar services with icons and links to detailed pages, plus a consultation CTA and SEO setup.",
  "frontend/src/pages/SubsidiesPage.tsx": "Presents information on government solar subsidies with cards, tables, and a consultation CTA, including SEO settings.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, fonts, and container settings while enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project metadata, required images, and features related to showing kW‑specific solar photos and handling user‑uploaded logos."
}