{
  "kind": "build_request",
  "title": "Fix deployment failure and publish the website",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate the current deployment/build failure and implement the necessary code/config fixes so the project builds successfully and can be deployed (published) without errors.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "publis this web",
          "🙏 Something went wrong with the deployment",
          "please solve error"
        ]
      },
      "acceptanceCriteria": [
        "A production build completes successfully with no TypeScript, bundler, or Motoko compile errors.",
        "A deploy/publish run completes successfully (no deployment error) and outputs a live URL/canister front-end that loads in the browser.",
        "The home page and at least these routes load without runtime errors: /, /about, /services, /projects, /contact, /calculator, /subsidies, /how-it-works."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a clear, English, project-local publish/deploy guide that documents the exact commands and prerequisites needed to publish the web app and how to verify it is live.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "publis this web"
        ]
      },
      "acceptanceCriteria": [
        "Repository includes an English deployment guide (e.g., README section) with step-by-step commands to build and deploy.",
        "The guide includes a verification checklist (e.g., which URLs/routes to open) to confirm the deployment is successful."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the deployed site correctly serves static assets and renders the site header and footer without broken images (including the configured brand logo path) in production.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "publis this web"
        ]
      },
      "acceptanceCriteria": [
        "After deployment, the SiteHeader and SiteFooter render without broken image icons.",
        "Static assets referenced from the UI load successfully in the deployed environment (no 404s for key images/styles/scripts during normal navigation)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit any files under frontend/src/components/ui or any immutable paths listed in SYSTEM_CONTEXT (compose them instead).",
    "Use English for any user-facing text added or modified as part of this request."
  ],
  "nonGoals": [
    "Adding new product features/pages beyond what is required to fix deployment and publish the existing site.",
    "Integrating third-party hosting providers or non-Internet-Computer deployment targets.",
    "Adding third-party authentication providers (only Internet Identity is supported)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}