{
  "kind": "build_request",
  "title": "Add company addresses/contact details and Board of Directors section with photos",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update all displayed company contact information to match the provided details, replacing any placeholder address/phone/email currently shown across the site (footer and Contact page). Use English for all user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "COMPANY DETAILS:\n\nHead Office Address:\nVillage + Post – Saurath,\nRahika,\nMadhubani – 847213,\nBihar, India\n\nBranch Office Address:\nMaruti Nagar Colony,\nKashi Vishwanath Area,\nVaranasi – 221005,\nUttar Pradesh, India\n\nContact Details:\nMobile: +91 77180 53222\nEmail: gkvsmartenergy@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "Site footer contact section no longer shows placeholder details (e.g., \"123 Solar Street...\", \"+91 98765 43210\", \"info@gkvsmartenergy.com\") and instead displays the provided Mobile (+91 77180 53222) and Email (gkvsmartenergy@gmail.com).",
        "Contact page displays both the Head Office address (Village + Post – Saurath, Rahika, Madhubani – 847213, Bihar, India) and the Branch Office address (Maruti Nagar Colony, Kashi Vishwanath Area, Varanasi – 221005, Uttar Pradesh, India).",
        "Phone link uses tel:+917718053222 and email link uses mailto:gkvsmartenergy@gmail.com.",
        "Any map/visit placeholder text on the Contact page references the provided office location(s) rather than the existing placeholder address."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a \"Board of Directors\" section to the About page listing the directors: Vishnu Kumar Chaudhary, Kartik Kumar Chaudhary, and Ganesh Kumar Chaudhary, each with a photo displayed at consistent sizing (square headshot style).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "LOGO,Directors:\n- Vishnu Kumar Chaudhary  \n- Kartik Kumar Chaudhary  \n- Ganesh Kumar Chaudhary"
        ]
      },
      "acceptanceCriteria": [
        "About page includes a clearly labeled \"Board of Directors\" section.",
        "The section lists exactly these names: Vishnu Kumar Chaudhary, Kartik Kumar Chaudhary, Ganesh Kumar Chaudhary.",
        "Each director is shown with an image and the images are rendered consistently in a square aspect ratio (1:1) with uniform on-page dimensions.",
        "Layout is responsive: directors display as a single column on small screens and a multi-column grid on larger screens without overflow or distortion."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the company logo is displayed consistently in the header and footer using the existing logo asset path, and add a safe fallback (alt text / graceful rendering) if the logo image fails to load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "LOGO,Directors:"
        ]
      },
      "acceptanceCriteria": [
        "Header continues to show the logo image and company name, using the existing logo path already referenced in the code.",
        "Footer continues to show the logo image and company name, using the existing logo path already referenced in the code.",
        "If the logo image cannot be loaded, the UI still shows meaningful branding via text (no broken layout)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add the required director photo image assets as static files under frontend/public/assets/generated and reference them from the new Board of Directors section (do not serve images from the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Photo Ka bhi size rakhe Directors: me"
        ]
      },
      "acceptanceCriteria": [
        "Three director images exist in frontend/public/assets/generated and are used by the About page Board of Directors section.",
        "No backend endpoints are introduced for serving images; images are loaded via static paths under /assets/generated/."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor Motoko (all logic in backend/main.mo).",
    "Do not edit any files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Implementing Google Maps API integration (the Contact page may keep a placeholder).",
    "Adding third-party authentication providers (only Internet Identity is supported, and no auth changes are required here).",
    "Creating or changing backend data models for directors or contact info (static site content updates only)."
  ],
  "imageRequirements": {
    "required": [
      "Neutral corporate director headshot placeholder portrait, square crop, soft background (director-vishnu.dim_500x500.png)",
      "Neutral corporate director headshot placeholder portrait, square crop, soft background (director-kartik.dim_500x500.png)",
      "Neutral corporate director headshot placeholder portrait, square crop, soft background (director-ganesh.dim_500x500.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}