{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Company contact info refresh and Board of Directors section with static photos",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace all placeholder company address/phone/email across the footer and Contact page with the provided English contact details and correct tel/mailto links.",
      "acceptanceCriteria": [
        "Site footer contact section no longer shows placeholder details (e.g., \"123 Solar Street...\", \"+91 98765 43210\", \"info@gkvsmartenergy.com\") and instead displays the provided Mobile (+91 77180 53222) and Email (gkvsmartenergy@gmail.com).",
        "Contact page displays both the Head Office address (Village + Post – Saurath, Rahika, Madhubani – 847213, Bihar, India) and the Branch Office address (Maruti Nagar Colony, Kashi Vishwanath Area, Varanasi – 221005, Uttar Pradesh, India).",
        "Phone link uses tel:+917718053222 and email link uses mailto:gkvsmartenergy@gmail.com.",
        "Any map/visit placeholder text on the Contact page references the provided office location(s) rather than the existing placeholder address."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Update the footer Contact Us block to show the provided Mobile (+91 77180 53222) and Email (gkvsmartenergy@gmail.com) and replace the placeholder address text with the provided office location details (at minimum, remove the current placeholder address/phone/email)."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Update Contact page content to display both Head Office and Branch Office addresses, change the phone link to tel:+917718053222, change the email link to mailto:gkvsmartenergy@gmail.com, and update the Visit Our Office placeholder text to reference the provided location(s). Continue using existing shadcn-ui Card layout components for these info panels; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a responsive Board of Directors section on the About page showing three directors with consistently sized square headshots.",
      "acceptanceCriteria": [
        "About page includes a clearly labeled \"Board of Directors\" section.",
        "The section lists exactly these names: Vishnu Kumar Chaudhary, Kartik Kumar Chaudhary, Ganesh Kumar Chaudhary.",
        "Each director is shown with an image and the images are rendered consistently in a square aspect ratio (1:1) with uniform on-page dimensions.",
        "Layout is responsive: directors display as a single column on small screens and a multi-column grid on larger screens without overflow or distortion."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Add a new \"Board of Directors\" section to the About page that renders exactly the three required director names with square (1:1) headshot images sourced from the static generated assets. Implement a responsive grid (single column on small screens; multi-column on larger screens) and ensure images use consistent sizing and non-distorting object-fit. Prefer existing shadcn-ui Card styling patterns already used on the page; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Keep the existing logo asset path in header/footer and add a resilient fallback so branding remains meaningful if the logo fails to load.",
      "acceptanceCriteria": [
        "Header continues to show the logo image and company name, using the existing logo path already referenced in the code.",
        "Footer continues to show the logo image and company name, using the existing logo path already referenced in the code.",
        "If the logo image cannot be loaded, the UI still shows meaningful branding via text (no broken layout)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Add a safe logo rendering fallback in the header while preserving the existing logo image path. If the logo image fails to load, gracefully render meaningful branding via text (and/or a non-image placeholder) without breaking layout."
        },
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Add a safe logo rendering fallback in the footer while preserving the existing logo image path. If the logo image fails to load, gracefully render meaningful branding via text (and/or a non-image placeholder) without breaking layout."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add the three director headshot images as static generated assets and reference them from the About page Board of Directors section.",
      "acceptanceCriteria": [
        "Three director images exist in frontend/public/assets/generated and are used by the About page Board of Directors section.",
        "No backend endpoints are introduced for serving images; images are loaded via static paths under /assets/generated/."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/director-vishnu.dim_500x500.png",
          "operation": "create",
          "description": "Add the required static director image asset at frontend/public/assets/generated/director-vishnu.dim_500x500.png for use in the Board of Directors section."
        },
        {
          "path": "frontend/public/assets/generated/director-kartik.dim_500x500.png",
          "operation": "create",
          "description": "Add the required static director image asset at frontend/public/assets/generated/director-kartik.dim_500x500.png for use in the Board of Directors section."
        },
        {
          "path": "frontend/public/assets/generated/director-ganesh.dim_500x500.png",
          "operation": "create",
          "description": "Add the required static director image asset at frontend/public/assets/generated/director-ganesh.dim_500x500.png for use in the Board of Directors section."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Wire the three static director images into the Board of Directors section using their static paths under frontend/public/assets/generated (director-vishnu.dim_500x500.png, director-kartik.dim_500x500.png, director-ganesh.dim_500x500.png) and ensure images render as uniformly sized square headshots."
        }
      ]
    }
  ]
}