{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "kW-matched calculator image and updated static logo asset",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure header and footer consistently render the updated static logo image, keeping the existing fallback only for image-load failure.",
      "acceptanceCriteria": [
        "The logo rendered in SiteHeader uses the same path as before (currently `/assets/generated/gkv-logo.dim_512x512.png`) but displays the new uploaded logo artwork.",
        "The logo rendered in SiteFooter matches the header logo and is visually consistent.",
        "If the logo image fails to load, the existing fallback UI still appears (no regression)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/gkv-logo.dim_512x512.png",
          "operation": "modify",
          "description": "Replace the existing logo artwork file with the user-uploaded logo while keeping the same filename/path so all existing references continue to work."
        },
        {
          "path": "frontend/src/lib/brand.ts",
          "operation": "create",
          "description": "Add a small shared constant (e.g., exported logo image path) so SiteHeader and SiteFooter reference the exact same logo path and stay consistent."
        },
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Use the shared logo path constant for the header logo image while preserving the current onError fallback behavior (shows 'GKV' only if the image fails to load)."
        },
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Use the shared logo path constant for the footer logo image while preserving the current onError fallback behavior (shows 'GKV' only if the image fails to load)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Show a deterministic kW-range-matched solar installation image on the Solar Calculator results based on results.systemSizeKW, with a safe fallback.",
      "acceptanceCriteria": [
        "Calculator page shows a kW-matched image near the results (based on `results.systemSizeKW`).",
        "The image selection is deterministic via defined kW ranges (e.g., <=2 kW, 3–5 kW, 6–10 kW, 11–20 kW, >20 kW).",
        "If an image is missing for a range, a safe fallback image is shown and the page layout does not break."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/solarKwImages.ts",
          "operation": "create",
          "description": "Add a helper that maps system size (kW) to a deterministic image path using defined kW ranges and provides a fallback image path if a range image is unavailable."
        },
        {
          "path": "frontend/src/pages/CalculatorPage.tsx",
          "operation": "modify",
          "description": "Render a representative solar installation image near the results section using the kW-to-image helper based on results.systemSizeKW, and add an image-load fallback so layout remains stable if an image cannot be loaded."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add the required static generated images under frontend/public/assets/generated and wire them into the UI via /assets/generated paths only.",
      "acceptanceCriteria": [
        "All newly generated images are placed under `frontend/public/assets/generated` and can be loaded by the browser via `/assets/generated/...` paths.",
        "No backend endpoints or storage are introduced for these images."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/solar-kw-02.dim_1200x600.png",
          "operation": "create",
          "description": "Add static generated image asset for small system size (<=2 kW) to be used by the calculator UI via /assets/generated paths."
        },
        {
          "path": "frontend/public/assets/generated/solar-kw-05.dim_1200x600.png",
          "operation": "create",
          "description": "Add static generated image asset for medium-small system size (3–5 kW) to be used by the calculator UI via /assets/generated paths."
        },
        {
          "path": "frontend/public/assets/generated/solar-kw-10.dim_1200x600.png",
          "operation": "create",
          "description": "Add static generated image asset for medium system size (6–10 kW) to be used by the calculator UI via /assets/generated paths."
        },
        {
          "path": "frontend/public/assets/generated/solar-kw-20.dim_1200x600.png",
          "operation": "create",
          "description": "Add static generated image asset for large system size (11–20 kW) to be used by the calculator UI via /assets/generated paths."
        },
        {
          "path": "frontend/public/assets/generated/solar-kw-50.dim_1200x600.png",
          "operation": "create",
          "description": "Add static generated image asset for very large system size (>20 kW) to be used by the calculator UI via /assets/generated paths."
        },
        {
          "path": "frontend/src/lib/solarKwImages.ts",
          "operation": "modify",
          "description": "Wire the exact generated filenames into the kW-range mapping and ensure the fallback uses a safe existing generated image path if any range image is unavailable at runtime."
        }
      ]
    }
  ]
}